In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
moma_file = "Resources/moma.csv"
moma_df = pd.read_csv(moma_file, encoding="latin1")
moma_df.head()

        Artist_Name  Birth_Year
0         2x4, Inc.      1994.0
1        A&E Design      1968.0
2  A. F. Gangkofner      1921.0
3    A. G. Fronzoni      1923.0
4   A. Michael Noll      1939.0

In [3]:
artists_file = "Resources/top_500_artists.csv"
artists_df = pd.read_csv(artists_file, encoding="latin1")
artists_df.head()

            Artist_Name       Turnover  Sold Lots Highest Price  Top_500_Rank
0  Jean-Michel BASQUIAT  $256,098,080         125  $45,315,000              1
1            Peter DOIG  $100,958,125          45  $21,127,500              2
2        Rudolf STINGEL   $52,389,232          27   $7,938,905              3
3          George CONDO   $49,248,967         100   $6,162,500              4
4            CHEN Yifei   $47,201,867          18  $22,640,280              5

In [4]:
import numpy as np

In [5]:
artists = set(np.unique(artists_df["Artist_Name"]))

In [6]:
moma_artists = set(np.unique(moma_df["Artist_Name"]))

In [7]:
len(moma_artists)

7686

In [8]:
len(artists)

499

In [9]:
# for a in artists:
#     if a.lower() in [x.lower() for x in moma_artists]:
#         print (a)
# Moma last name have lowercase last names and artist_names have upper case. have to normalize the front or it won't merge.  
# create a function that lower the name and everything matches
# apply method update the table artist name

In [10]:
def lower_artist_name(row):
    return row["Artist_Name"].lower()

In [11]:
artists_df["artist"] = artists_df.apply(lower_artist_name, axis=1)

In [12]:
lower_artist_name

In [13]:
moma_df["artist"] = moma_df.apply(lower_artist_name, axis=1)

In [14]:
#merged_df = pd.merge(moma_df, artists_df, how='left', on='Artist_Name') _x inidicates the first dataframe. -y is the second dataframe

#merged_df.head(20)
merged_df = pd.merge(moma_df, artists_df, how='inner', on='artist')
merged_df.head()

,Artist_Name_x,Birth_Year,artist,Artist_Name_y,Turnover,Sold Lots,Highest Price,Top_500_Rank
0,Adam Pendleton,1984.0,adam pendleton,Adam PENDLETON,"$517,931",4,"$225,000",284
1,Ai Weiwei,1957.0,ai weiwei,AI Weiwei,"$3,702,757",46,"$1,029,700",61
2,Albert Oehlen,1954.0,albert oehlen,Albert OEHLEN,"$13,670,448",30,"$2,678,011",26
3,Alex Israel,1982.0,alex israel,Alex ISRAEL,"$562,663",4,"$212,500",256
4,Amy Sillman,1955.0,amy sillman,Amy SILLMAN,"$1,752,359",11,"$575,209",115

In [15]:
new_df = merged_df.drop(["Artist_Name_x","Artist_Name_y"], axis = 1)
new_df.head()

,Birth_Year,artist,Turnover,Sold Lots,Highest Price,Top_500_Rank
0,1984.0,adam pendleton,"$517,931",4,"$225,000",284
1,1957.0,ai weiwei,"$3,702,757",46,"$1,029,700",61
2,1954.0,albert oehlen,"$13,670,448",30,"$2,678,011",26
3,1982.0,alex israel,"$562,663",4,"$212,500",256
4,1955.0,amy sillman,"$1,752,359",11,"$575,209",115

In [16]:
from sqlalchemy import create_engine 
engine=create_engine("mysql+mysqldb://root:"+'Datarules1!'+"@localhost:3306",encoding="latin1")
#engine.execute(charset="utf8")
engine.execute("CREATE DATABASE IF NOT EXISTS Artists_db")
engine.execute("use Artists_db")

In [17]:
#engine = create_engine("mysql+mysqldb://root@localhost:"+'Datarules1!'+"@LTUSSACPC0JCR4Z:3306/Artist_db")
#engine = create_engine("sqlite://", echo=False)

In [20]:
new_df.to_sql(name='new_df', con=engine, if_exists='append',index=False)
#New_df.head()